#pragma once
#include <cstdint>
#include "!GlobalTypes.hpp"

// /////////////////////////////////////////////////////////////
// Binary: client.dll
// Classes count: 1,778 (Allocated) | 1,792 (Unallocated)
// Enums count: 1 (Allocated) | 11 (Unallocated)
// Created using source2gen - github.com/neverlosecc/source2gen
// /////////////////////////////////////////////////////////////

// Registered binary: client.dll (project 'client')
// Enumerator count: 5
// Alignment: 4
// Size: 0x4
enum class C_BaseCombatCharacter__WaterWakeMode_t : uint32_t
{
	WATER_WAKE_NONE = 0x0,
	WATER_WAKE_IDLE = 0x1,
	WATER_WAKE_WALKING = 0x2,
	WATER_WAKE_RUNNING = 0x3,
	WATER_WAKE_WATER_OVERHEAD = 0x4,
};

// Registered binary: client.dll (project 'client')
// Enumerator count: 2
// Alignment: 4
// Size: 0x4
enum class StartupBehavior_t : uint32_t
{
	UNIT_STARTUP_BEHAVIOR_DEFAULT = 0x0,
	UNIT_STARTUP_BEHAVIOR_TAUNT = 0x1,
};

// Registered binary: client.dll (project 'client')
// Enumerator count: 6
// Alignment: 4
// Size: 0x4
enum class PortraitScale_t : uint32_t
{
	PORTRAIT_SCALE_INVALID = 0xffffffffffffffff,
	PORTRAIT_SCALE_LOADOUT = 0x0,
	PORTRAIT_SCALE_ALTERNATE_LOADOUT = 0x1,
	PORTRAIT_SCALE_WORLD = 0x2,
	PORTRAIT_SCALE_SPECTATOR_LOADOUT = 0x3,
	PORTRAIT_SCALE_VERSUS_LOADOUT = 0x4,
};

// Registered binary: client.dll (project 'client')
// Enumerator count: 99
// Alignment: 4
// Size: 0x4
enum class EGCCitadelClientMessages : uint32_t
{
	k_EMsgClientToGCStartMatchmaking = 0x2332,
	k_EMsgClientToGCStartMatchmakingResponse = 0x2333,
	k_EMsgClientToGCStopMatchmaking = 0x2334,
	k_EMsgClientToGCStopMatchmakingResponse = 0x2335,
	k_EMsgGCToClientMatchmakingStopped = 0x2336,
	k_EMsgClientToGCLeaveLobby = 0x2337,
	k_EMsgClientToGCLeaveLobbyResponse = 0x2338,
	k_EMsgClientToGCIsInMatchmaking = 0x2339,
	k_EMsgClientToGCIsInMatchmakingResponse = 0x233a,
	k_EMsgGCToClientDevPlaytestStatus = 0x233b,
	k_EMsgClientToGCDevSetMMBias = 0x233f,
	k_EMsgClientToGCGetProfileCard = 0x2340,
	k_EMsgClientToGCGetProfileCardResponse = 0x2341,
	k_EMsgClientToGCUpdateRoster = 0x2342,
	k_EMsgClientToGCUpdateRosterResponse = 0x2343,
	k_EMsgGCToClientProfileCardUpdated = 0x2344,
	k_EMsgGCToClientDevAnnouncements = 0x2345,
	k_EMsgClientToGCModifyDevAnnouncements = 0x2346,
	k_EMsgClientToGCModifyDevAnnouncementsResponse = 0x2347,
	k_EMsgGCToClientSDRTicket = 0x238c,
	k_EMsgClientToGCReplacementSDRTicket = 0x238d,
	k_EMsgClientToGCReplacementSDRTicketResponse = 0x238e,
	k_EMsgClientToGCSetServerConVar = 0x2393,
	k_EMsgClientToGCSetServerConVarResponse = 0x2394,
	k_EMsgClientToGCSpectateLobby = 0x2395,
	k_EMsgClientToGCSpectateLobbyResponse = 0x2396,
	k_EMsgClientToGCPostMatchSurveyResponse = 0x2397,
	k_EMsgClientToGCGetMatchHistory = 0x2398,
	k_EMsgClientToGCGetMatchHistoryResponse = 0x2399,
	k_EMsgClientToGCSpectateUser = 0x239c,
	k_EMsgClientToGCSpectateUserResponse = 0x239d,
	k_EMsgClientToGCGetGlobalMatchHistory = 0x239e,
	k_EMsgClientToGCGetGlobalMatchHistoryResponse = 0x239f,
	k_EMsgClientToGCPartyCreate = 0x23a3,
	k_EMsgClientToGCPartyCreateResponse = 0x23a4,
	k_EMsgClientToGCPartyLeave = 0x23a5,
	k_EMsgClientToGCPartyLeaveResponse = 0x23a6,
	k_EMsgClientToGCPartyJoin = 0x23a7,
	k_EMsgClientToGCPartyJoinResponse = 0x23a8,
	k_EMsgClientToGCPartyAction = 0x23a9,
	k_EMsgClientToGCPartyActionResponse = 0x23aa,
	k_EMsgClientToGCPartyStartMatch = 0x23ab,
	k_EMsgClientToGCPartyStartMatchResponse = 0x23ac,
	k_EMsgClientToGCPartyInviteUser = 0x23ad,
	k_EMsgClientToGCPartyInviteUserResponse = 0x23ae,
	k_EMsgGCToClientPartyEvent = 0x23af,
	k_EMsgGCToClientCanRejoinParty = 0x23b1,
	k_EMsgClientToGCPartyJoinViaCode = 0x23b2,
	k_EMsgClientToGCPartyJoinViaCodeResponse = 0x23b3,
	k_EMsgClientToGCPartyUpdateRoster = 0x23b4,
	k_EMsgClientToGCPartyUpdateRosterResponse = 0x23b5,
	k_EMsgClientToGCPartySetReadyState = 0x23b6,
	k_EMsgClientToGCPartySetReadyStateResponse = 0x23b7,
	k_EMsgClientToGCDevForceMatchFormation = 0x23ca,
	k_EMsgClientToGCDevForceMatchFormationResponse = 0x23cb,
	k_EMsgClientToGCGetAccountStats = 0x23cc,
	k_EMsgClientToGCGetAccountStatsResponse = 0x23cd,
	k_EMsgGCToClientAccountStatsUpdated = 0x23ce,
	k_EMsgClientToGCGetMatchMetaData = 0x23cf,
	k_EMsgClientToGCGetMatchMetaDataResponse = 0x23d0,
	k_EMsgClientToGCDevAction = 0x23d4,
	k_EMsgClientToGCDevActionResponse = 0x23d5,
	k_EMsgClientToGCRecordClientEvents = 0x23d6,
	k_EMsgClientToGCRecordClientEventsResponse = 0x23d7,
	k_EMsgClientToGCSetNewPlayerProgress = 0x23d8,
	k_EMsgClientToGCSetNewPlayerProgressResponse = 0x23d9,
	k_EMsgClientToGCUpdateAccountSync = 0x23da,
	k_EMsgClientToGCUpdateAccountSyncResponse = 0x23db,
	k_EMsgClientToGCGetHeroChoice = 0x23dc,
	k_EMsgClientToGCGetHeroChoiceResponse = 0x23dd,
	k_EMsgClientToGCUnlockHero = 0x23de,
	k_EMsgClientToGCUnlockHeroResponse = 0x23df,
	k_EMsgClientToGCBookUnlock = 0x23e0,
	k_EMsgClientToGCBookUnlockResponse = 0x23e1,
	k_EMsgClientToGCGetBook = 0x23e2,
	k_EMsgClientToGCGetBookResponse = 0x23e3,
	k_EMsgGCToClientBookUpdated = 0x23e4,
	k_EMsgClientToGCSubmitPlaytestUser = 0x23e5,
	k_EMsgClientToGCSubmitPlaytestUserResponse = 0x23e6,
	k_EMsgClientToGCGetDevMatchInfo = 0x23e7,
	k_EMsgClientToGCGetDevMatchInfoResponse = 0x23e8,
	k_EMsgClientToGCUpdateHeroBuild = 0x23e9,
	k_EMsgClientToGCUpdateHeroBuildResponse = 0x23ea,
	k_EMsgClientToGCFindHeroBuilds = 0x23eb,
	k_EMsgClientToGCFindHeroBuildsResponse = 0x23ec,
	k_EMsgClientToGCReportPlayerFromMatch = 0x23ed,
	k_EMsgClientToGCReportPlayerFromMatchResponse = 0x23ee,
	k_EMsgClientToGCGetAccountMatchReports = 0x23ef,
	k_EMsgClientToGCGetAccountMatchReportsResponse = 0x23f0,
	k_EMsgClientToGCDeleteHeroBuild = 0x23f1,
	k_EMsgClientToGCDeleteHeroBuildResponse = 0x23f2,
	k_EMsgClientToGCGetActiveMatches = 0x23f3,
	k_EMsgClientToGCGetActiveMatchesResponse = 0x23f4,
	k_EMsgClientToGCGetDiscordLink = 0x23f5,
	k_EMsgClientToGCGetDiscordLinkResponse = 0x23f6,
	k_EMsgClientToGCPartySetMode = 0x23f7,
	k_EMsgClientToGCPartySetModeResponse = 0x23f8,
	k_EMsgClientToGCGrantForumAccess = 0x23f9,
	k_EMsgClientToGCGrantForumAccessResponse = 0x23fa,
};

// Registered binary: client.dll (project 'client')
// Enumerator count: 7
// Alignment: 4
// Size: 0x4
enum class ECitadelPingWheelMessageType_t : uint32_t
{
	CITADEL_PING_WHEEL_PREGAME = 0x0,
	CITADEL_PING_WHEEL_INPROGRESS = 0x1,
	CITADEL_PING_WHEEL_DISABLED_WHILE_DEAD = 0x2,
	CITADEL_PING_WHEEL_POSTGAME = 0x3,
	CITADEL_PING_WHEEL_CONTEXTUAL = 0x4,
	// MPropertySuppressEnumerator
	CITADEL_PING_WHEEL_SUBNAV = 0x5,
	// MPropertySuppressEnumerator
	CITADEL_PING_WHEEL_COUNT = 0x6,
};

// Registered binary: client.dll (project 'client')
// Enumerator count: 3
// Alignment: 4
// Size: 0x4
enum class ECitadelNewPlayerProgressFlag : uint32_t
{
	k_eNewPlayerProgress_GettingStarted = 0x1,
	k_eNewPlayerProgress_HeroTraining = 0x2,
	k_eNewPlayerProgress_LaneTraining = 0x3,
};

// Registered binary: client.dll (project 'client')
// Enumerator count: 54
// Alignment: 4
// Size: 0x4
enum class ECitadelClientAccountEvent : uint32_t
{
	k_eLaunchedHeroTest = 0x1,
	k_eViewedProfile = 0x2,
	k_eViewedSocial = 0x3,
	k_eViewedHeroes = 0x4,
	k_eViewedHeroDetails = 0x5,
	k_eViewedPatchNotes = 0x6,
	k_eViewedEvents = 0x7,
	k_eViewedGettingStarted = 0x8,
	k_eViewedGuidePage = 0x9,
	k_eLaunchedClient = 0xa,
	k_eEditRoster = 0xb,
	k_eViewedWatch = 0xc,
	k_eCreatedParty = 0xd,
	k_eCreatedPartyWithInvite = 0xe,
	k_eViewedSelfProfile = 0xf,
	k_eJoinedPartyCode = 0x10,
	k_eSentPartyInvite = 0x11,
	k_eAcceptPartyInvite = 0x12,
	k_eRejectPartyInvite = 0x13,
	k_eSpectateUser = 0x14,
	k_eSpectateMatch = 0x15,
	k_eEnteredMatchMaking = 0x16,
	k_eLeftMatchMaking = 0x17,
	k_eEnteredPartyMatchMaking = 0x18,
	k_eLeftPartyMatchMaking = 0x19,
	k_eDownloadedReplay = 0x1a,
	k_eWatchedReplay = 0x1b,
	k_eViewMatchDetails = 0x1c,
	k_eMatchDetailsTab = 0x1d,
	k_eDeleteReplay = 0x1e,
	k_eBotMatch_Guided = 0x1f,
	k_eBotMatch_Easy = 0x20,
	k_eBotMatch_Hard = 0x21,
	k_eLiveUpdatedRoster = 0x22,
	k_eMatchMakingIdle_Displayed = 0x23,
	k_eMatchMakingIdle_Stopped = 0x24,
	k_eConnectReacquireTicket = 0x25,
	k_eConnectAttemptReconnect = 0x26,
	k_eDisconnectPresentedPrompt = 0x27,
	k_eDisconnectConfirmed = 0x28,
	k_eViewedSettings_Options = 0x29,
	k_eViewedSettings_Video = 0x2a,
	k_eViewedSettings_Audio = 0x2b,
	k_eViewedSettings_HotKey = 0x2c,
	k_eViewedSettings_ChatWheel = 0x2d,
	k_eViewedSettings_About = 0x2e,
	k_eOpenedSubmitFeedback = 0x2f,
	k_eTutorialSkip_Pressed = 0x30,
	k_eTutorialSkip_Confirmed = 0x31,
	k_eViewedGuidePage_5s = 0x32,
	k_eViewedGuidePage_15s = 0x33,
	k_eViewedGuidePage_30s = 0x34,
	k_eViewedGuidePage_60s = 0x35,
	k_eOpenedBookTest = 0x36,
};

// Registered binary: client.dll (project 'client')
// Enumerator count: 3
// Alignment: 4
// Size: 0x4
enum class EProfileCardSlotType : uint32_t
{
	k_EProfileCardSlotType_Empty = 0x0,
	k_EProfileCardSlotType_Stat = 0x1,
	k_EProfileCardSlotType_Hero = 0x2,
};

// Registered binary: client.dll (project 'client')
// Enumerator count: 5
// Alignment: 4
// Size: 0x4
enum class PortraitDisplayMode_t : uint32_t
{
	PORTRAIT_DISPLAY_MODE_INVALID = 0xffffffffffffffff,
	PORTRAIT_DISPLAY_MODE_LOADOUT = 0x0,
	PORTRAIT_DISPLAY_MODE_LOADOUT_DIRE = 0x1,
	PORTRAIT_DISPLAY_MODE_LOADOUT_SMALL = 0x2,
	PORTRAIT_DISPLAY_MODE_TREASURE_SMALL = 0x3,
};

// Registered binary: client.dll (project 'client')
// Enumerator count: 3
// Alignment: 4
// Size: 0x4
enum class ECitadelAccountPermissionFlag : uint32_t
{
	k_eAccountPermission_PrivateBot = 0x1,
	k_eAccountPermission_CoopBot = 0x2,
	k_eAccountPermission_Unranked = 0x3,
};

// Registered binary: client.dll (project 'client')
// Enumerator count: 7
// Alignment: 4
// Size: 0x4
enum class P2P_Messages : uint32_t
{
	p2p_TextMessage = 0x100,
	p2p_Voice = 0x101,
	p2p_Ping = 0x102,
	p2p_VRAvatarPosition = 0x103,
	p2p_WatchSynchronization = 0x104,
	p2p_FightingGame_GameData = 0x105,
	p2p_FightingGame_Connection = 0x106,
};

struct fogparams_t;
struct GameTime_t;
struct CSkeletonInstance;
struct CNetworkVelocityVector;
struct AttachmentHandle_t;
struct CRenderComponent;
struct CHitboxComponent;
struct CCollisionProperty;
struct CGlowProperty;
struct CNetworkViewOffsetVector;
struct CClientAlphaProperty;
struct C_PointCamera;
struct ParticleIndex_t;
struct C_EnvWindShared;
struct CRemapFloat;
struct CitadelCameraOperationsSequence_t;
struct GameTick_t;
struct C_fogplayerparams_t;
struct audioparams_t;
struct C_RopeKeyframe;
struct CModifierLevelFloat;
struct CGameSceneNode;
struct CNetworkVarChainer;
struct C_LightGlowOverlay;
struct CModelState;
struct CBaseAnimGraphController;
struct SatVolumeIndex_t;
struct DOFDesc_t;
struct CCitadelAbilityComponent;
struct CPointOffScreenIndicatorUi;
struct CRangeFloat;
struct C_EconItemView;
struct ShotID_t;
struct C_PointClientUIWorldPanel;
struct HeroID_t;
struct HeroStatsUI_t;
struct HeroStatsDisplay_t;
struct CFootstepTableHandle;
struct sky3dparams_t;
struct C_SkyCamera;
struct C_CommandContext;
struct CAnimGraphNetworkedVariables;
struct HSequence;
struct CBaseAnimGraph;
struct PhysicsRagdollPose_t;
struct AttackData_t;
struct AmmoIndex_t;
struct CountdownTimer;
struct CPlayer_WeaponServices;
struct CPlayer_ItemServices;
struct CPlayer_AutoaimServices;
struct CPlayer_ObserverServices;
struct CPlayer_WaterServices;
struct CPlayer_UseServices;
struct CPlayer_FlashlightServices;
struct CPlayer_CameraServices;
struct CPlayer_MovementServices;
struct C_RopeKeyframe::CPhysicsDelegate;
struct CCitadelHeroComponent;
struct TimedEvent;
struct CFireOverlay;
struct ModelConfigHandle_t;
struct CEntityIOOutput;
struct IncompatibleFilter_t;
struct CCitadelWeaponInfo;
struct ProjectileInfo_t;
struct DeploymentInfo_t;
struct AbilityTooltipDetails_t;
struct CitadelAbilityHUDPanel_t;
struct AdditionalAbilities_t;
struct CAttributeContainer;
struct style_index_t;
struct CCitadelAutoScaledTime;
struct CAttributeManager;
struct item_definition_index_t;
struct itemid_t;
struct CAttributeList;
struct CInButtonState;
struct CSkillFloat;
struct AbilityResource_t;
struct CCitadelModifierResponseRules_t;
struct attrib_definition_index_t;
struct NPCStatusEffectMap_t;
struct CSkillInt;
struct ModifierSerialNumber_t;
struct CModifierHandleBase;
struct ModifierRuntimeHandle_t;
struct CBreakableStageHelper;
struct CCitadelPlayerClipComponent;
struct ice_path_shard_model_desc_t;
struct VPhysicsCollisionAttribute_t;
struct ModifierPropRuntimeHandle_t;
struct shard_model_desc_t;
struct CLightComponent;
struct C_CitadelGameRules;
struct SceneEventId_t;
struct CBodyComponent;
struct CNetworkTransmitComponent;
struct CModifierProperty;
struct CParticleProperty;
struct ChangeAccessorFieldPathIndex_t;
struct CEntityIdentity;
struct CPropDataComponent;
struct C_CitadelPlayerPawn;
struct FireUserEntityIO_t;
struct CScriptComponent;
struct PlayerDataGlobal_t;
struct CitadelLobbyPlayerSlot_t;
struct CEntityInstance;
struct CGameSceneNodeHandle;
struct CNetworkOriginCellCoordQuantizedVector;
struct ModifierTrackedParticle_t;
struct MatchID_t;
struct CDecalInfo;
struct C_FireSmoke;

// Registered binary: client.dll (project 'entity2')
// Alignment: 8
// Size: 0x38
// Has VTable
// 
// MNetworkVarNames "CEntityIdentity * m_pEntity"
// MNetworkVarNames "CScriptComponent::Storage_t m_CScriptComponent"
class CEntityInstance
{
private:
	[[maybe_unused]] uint8_t __pad0000[0x8]; // 0x0
public:
	// MNetworkDisable
	CUtlSymbolLarge m_iszPrivateVScripts; // 0x8	
	// MNetworkEnable
	// MNetworkPriority "56"
	CEntityIdentity* m_pEntity; // 0x10	
private:
	[[maybe_unused]] uint8_t __pad0018[0x10]; // 0x18
public:
	// MNetworkEnable
	// MNetworkDisable
	CScriptComponent* m_CScriptComponent; // 0x28	
	bool m_bVisibleinPVS; // 0x30	
};

// Registered binary: client.dll (project 'client')
// Alignment: 8
// Size: 0x18
// Has VTable
// Has Trivial Destructor
// 
// MNetworkVarNames "uint64 m_hStableHandle"
class CModifierHandleBase
{
private:
	[[maybe_unused]] uint8_t __pad0000[0x8]; // 0x0
public:
	// MNetworkEnable
	// MNetworkSerializer "modifier_handle"
	uint64_t m_hStableHandle; // 0x8	
	
	// Datamap fields:
	// void CModifierHandleBase; // 0x0
	// void m_hRuntimeListHandle; // 0x10
};

// Registered binary: client.dll (project 'client')
// Alignment: 8
// Size: 0x3e0
// Has VTable
// 
// MGetKV3ClassDefaults
class CModifierVData : public CEntitySubclassVDataBase
{
public:
	// MPropertyStartGroup "Time"
	CModifierLevelFloat m_flDuration; // 0x28	
	// MPropertyStartGroup "Time"
	// MPropertyDescription "If set, the duration will not get reduced from a refresh with a shorter duration"
	bool m_bKeepMaximumDurationOnRefresh; // 0x38	
private:
	[[maybe_unused]] uint8_t __pad0039[0x7]; // 0x39
public:
	// MPropertyStartGroup "Visuals"
	// MPropertyDescription "Particle system to attach to the parent of the modifier"
	CResourceNameTyped< CWeakHandle< InfoForResourceTypeIParticleSystemDefinition > > m_strParticleEffect; // 0x40	
	// MPropertyStartGroup "Visuals"
	// MPropertyDescription "Name of particle control point config to use for ambient effect (empty means use 'preview' config)"
	CUtlString m_strParticleEffectConfig; // 0x120	
	// MPropertyGroupName "Visuals"
	// MPropertyDescription "Status Effect to apply to the parent of the modifier"
	CResourceNameTyped< CWeakHandle< InfoForResourceTypeIParticleSystemDefinition > > m_strParticleStatusEffect; // 0x128	
	// MPropertyStartGroup "Visuals"
	// MPropertyDescription "Name of particle control point config to use for status effect (empty means use 'preview' config)"
	CUtlString m_strParticleStatusEffectConfig; // 0x208	
	// MPropertyGroupName "Visuals"
	// MPropertyDescription "Screen-space particle system to create if the parent of the modifier is the local player"
	CResourceNameTyped< CWeakHandle< InfoForResourceTypeIParticleSystemDefinition > > m_strScreenParticleEffect; // 0x210	
	// MPropertyStartGroup "Visuals"
	// MPropertyDescription "Name of particle control point config to use for screen-space effect (empty means use 'preview' config)"
	CUtlString m_strScreenParticleEffectConfig; // 0x2f0	
	// MPropertyGroupName "Visuals"
	// MPropertyDescription "Priority of this status effect relative to others"
	int32_t m_nStatusEffectPriority; // 0x2f8	
private:
	[[maybe_unused]] uint8_t __pad02fc[0x4]; // 0x2fc
public:
	// MPropertyGroupName "Visuals"
	CUtlVector< ModifierRenderAttribute_t > m_vecRenderAttributes; // 0x300	
	// MPropertyGroupName "Sounds"
	CSoundEventName m_sStartSound; // 0x318	
	// MPropertyGroupName "Sounds"
	CSoundEventName m_sAmbientLoopingSound; // 0x328	
	// MPropertyGroupName "Sounds"
	ModifierSoundRecipients_t m_nAmbientLoopingSoundRecipients; // 0x338	
private:
	[[maybe_unused]] uint8_t __pad033c[0x4]; // 0x33c
public:
	// MPropertyGroupName "Sounds"
	CSoundEventName m_sEndSound; // 0x340	
	// MPropertyGroupName "Scripted Settings"
	CBitVecEnum< EModifierState > m_nEnabledStateMask; // 0x350	
	// MPropertyGroupName "Scripted Settings"
	CBitVecEnum< EModifierState > m_nDisabledStateMask; // 0x364	
	// MPropertyGroupName "Scripted Settings"
	ModifierAttribute_t m_nAttributes; // 0x378	
private:
	[[maybe_unused]] uint8_t __pad037c[0x4]; // 0x37c
public:
	// MPropertyGroupName "Scripted Settings"
	// MPropertyDescription "Scripted Modifier Values"
	CUtlVector< ModifierScriptValue_t > m_vecScriptValues; // 0x380	
	// MPropertyGroupName "Scripted Settings"
	// MPropertyDescription "Scripted Event Handlers"
	CUtlVector< ModifierScriptedEventHandler_t > m_vecScriptEventHandlers; // 0x398	
	ModifierDisableGroup_t m_nDisableGroupsMask; // 0x3b0	
	// MPropertyDescription "When set, the modifier only provides data to requests made directly to the attached entity and not to other modifier properties that the owner provides to."
	bool m_bPrivateAccess; // 0x3b4	
	// MPropertyGroupName "UI"
	// MPropertyDescription "When set, the modifier will not be visible to UI or visible modifier list."
	bool m_bIsHidden; // 0x3b5	
private:
	[[maybe_unused]] uint8_t __pad03b6[0x2]; // 0x3b6
public:
	// MPropertyGroupName "UI"
	// MPropertySuppressExpr "m_bIsHidden != true"
	ModifierHiddenType_t m_eHiddenType; // 0x3b8	
private:
	[[maybe_unused]] uint8_t __pad03bc[0x4]; // 0x3bc
public:
	// MPropertyGroupName "UI"
	// MPropertyDescription "When set, use the value as localization key."
	CUtlString m_sLocalizationName; // 0x3c0	
	// MPropertyDescription "When to consider the modifier a debuff."
	ModifierDebuffType_t m_eDebuffType; // 0x3c8	
	// MPropertyDescription "When set, stacks will automatically be decayed after a duration's worth of time has passed.  Only makes sense if adding a stack refreshed the modifier."
	bool m_bAutomaticallyDecayStacks; // 0x3cc	
};

// Registered binary: client.dll (project 'client')
// Alignment: 8
// Size: 0x90
// Has VTable
// Is Abstract
class CBaseModifier
{
private:
	[[maybe_unused]] uint8_t __pad0000[0x28]; // 0x0
public:
	ModifierSerialNumber_t m_nSerialNumber; // 0x28	
	GameTime_t m_flLastAppliedTime; // 0x2c	
	GameTime_t m_flCreationTime; // 0x30	
	float m_flDuration; // 0x34	
	CHandle< C_BaseEntity > m_hCaster; // 0x38	
	CHandle< C_BaseEntity > m_hAbility; // 0x3c	
	CModifierHandleBase m_hAuraProvider; // 0x40	
	CUtlStringToken m_nAbilitySubclassID; // 0x58	
	uint8_t m_iAttributes; // 0x5c	
	uint8_t m_iTeam; // 0x5d	
	int16_t m_iStackCount; // 0x5e	
	int16_t m_iMaxStackCount; // 0x60	
private:
	[[maybe_unused]] uint8_t __pad0062[0x6]; // 0x62
public:
	CUtlVector< GameTime_t >* m_pVecStackDecayTimes; // 0x68	
	uint8_t m_eDestroyReason; // 0x70	
	bool m_bDisabled; // 0x71	
	bool m_bSuppressSendModifier; // 0x72	
private:
	[[maybe_unused]] uint8_t __pad0073[0x1]; // 0x73
public:
	float m_flThinkInterval; // 0x74	
	GameTime_t m_flThinkIntervalStartTime; // 0x78	
	float m_flTimeScale; // 0x7c	
	CUtlVector< IModifierTrackedObject* >* m_pVecTrackedObjects; // 0x80	
	ModifierRuntimeHandle_t m_hModifierListHandle; // 0x88	
	uint8_t m_nDebugHelperFlags; // 0x8c	
	
	// Datamap fields:
	// void m_pModifierProp; // 0x20
	// void m_pSubclassVData; // 0x10
};

// Registered binary: client.dll (project 'client')
// Alignment: 8
// Size: 0xc0
// Has VTable
// Is Abstract
class CCitadelModifier : public CBaseModifier
{
public:
	// Datamap fields:
	// void m_pVecAbilityValues; // 0x98
	// float m_flEffectiveness; // 0xa0
	// No schema binary for binding
};

// Registered binary: client.dll (project 'client')
// Alignment: 8
// Size: 0x190
// Has VTable
class CCitadel_Modifier_Rutger_ForceField_PushOut : public CCitadelModifier
{
public:
	Vector m_vStart; // 0xc0	
	Vector m_vDest; // 0xcc	
	Vector m_vCenter; // 0xd8	
};

// Registered binary: client.dll (project 'client')
// Alignment: 8
// Size: 0x5f0
// Has VTable
// 
// MGetKV3ClassDefaults
// MPropertySuppressBaseClassField
class CCitadelModifierVData : public CModifierVData
{
public:
	bool m_bIsBuildup; // 0x3e0	
	// MPropertySuppressField
	bool m_bNetworkValuesForStatsPreview; // 0x3e1	
private:
	[[maybe_unused]] uint8_t __pad03e2[0x6]; // 0x3e2
public:
	CUtlVector< CUtlString > m_vecAutoRegisterModifierValueFromAbilityPropertyName; // 0x3e8	
	// MPropertyStartGroup "Kill & Assist Credit"
	bool m_bCasterCountsAsAssister; // 0x400	
private:
	[[maybe_unused]] uint8_t __pad0401[0x3]; // 0x401
public:
	// MPropertyDescription "When set, an additional, invisible modifier will be left on the parent when this modifier expires.  This is to aid in giving assist credit for modifiers that deal no damage (ex. Astro's Lasso)"
	float m_flLingeringAssistWindow; // 0x404	
	// MPropertyStartGroup "Time"
	// MPropertyDescription "When set, the duration will get scaled depending on the owner's timescale"
	bool m_bDurationCanBeTimeScaled; // 0x408	
	bool m_bDurationReducible; // 0x409	
private:
	[[maybe_unused]] uint8_t __pad040a[0x2]; // 0x40a
public:
	// MPropertyDescription "Whose timescale to use when adjusting duration."
	ModifierTimeScaleSource_t m_eTimeScaleSource; // 0x40c	
	// MPropertyDescription "When true, the 'effectiveness' value for the modifier will be used to scale the duration. You most likely want 'Keep Maximum Duration On Refresh' to match this value"
	bool m_bDurationAffectedByEffectiveness; // 0x410	
private:
	[[maybe_unused]] uint8_t __pad0411[0x7]; // 0x411
public:
	// MPropertyStartGroup "Visuals"
	// MPropertyDescription "A list of AnimGraph parameters whose values will get set to a specific value when this modifier is applied, and restored when the modifier is destroyed."
	CUtlVector< CCitadelTrackedAnimGraphModifierState_t > m_vecSetAndTrackedAnimGraphParams; // 0x418	
	// MPropertyDescription "A list of Bodygroups whose values will get set to a specific value when this modifier is applied, and restored when the modifier is destroyed."
	CUtlVector< CCitadelTrackedBodygroupModifierState_t > m_vecSetAndTrackedBodyGroups; // 0x430	
	// MPropertyStartGroup "UI"
	ModifierOverheadDrawType_t m_eDrawOverheadStatus; // 0x448	
	bool m_bReverseHudProgressBar; // 0x44c	
private:
	[[maybe_unused]] uint8_t __pad044d[0x3]; // 0x44d
public:
	CUtlString m_strSmallIconCssClass; // 0x450	
	CUtlString m_strHintText; // 0x458	
	CPanoramaImageName m_strHudIcon; // 0x460	
	HudDisplayLocation_t m_eHudDisplayLocation; // 0x470	
private:
	[[maybe_unused]] uint8_t __pad0474[0x4]; // 0x474
public:
	// MPropertyDescription "When set, the message will appear in the middle of the HUD for the target player."
	CUtlString m_strHudMessageText; // 0x478	
	// MPropertyDescription "When set, the modifier will not be visible overhead of the casting player for the other players"
	bool m_bIsHiddenOverhead; // 0x480	
private:
	[[maybe_unused]] uint8_t __pad0481[0x7]; // 0x481
public:
	// MPropertyDescription "A set of modifier values that will be forced tp show in the UI if they have a value (normally requires a limited duration set)"
	CUtlVector< EModifierValue > m_vecAlwaysShowInStatModifierUI; // 0x488	
	// MPropertyStartGroup "Responses"
	CCitadelModifierResponseRules_t m_OnCreateResponse; // 0x4a0	
	// MPropertyStartGroup "Camera"
	CitadelCameraOperationsSequence_t m_cameraSequenceCreated; // 0x4d8	
	// MPropertyDescription "By default, we stop the sequence from 'Sequence Created' once the modifier is removed.  Un-check this to allow it to continue past the modifier's lifetime."
	bool m_bEndCreatedSequenceOnRemove; // 0x558	
private:
	[[maybe_unused]] uint8_t __pad0559[0x7]; // 0x559
public:
	CitadelCameraOperationsSequence_t m_cameraSequenceRemoved; // 0x560	
	// MPropertyGroupName "Sounds"
	CSoundEventName m_sExpiredSound; // 0x5e0	
};

// Registered binary: client.dll (project 'client')
// Alignment: 8
// Size: 0xc0
// Has VTable
class CCitadel_Modifier_LingeringAssist : public CCitadelModifier
{
public:
	// No schema binary for binding
};

// Registered binary: client.dll (project 'entity2')
// Alignment: 8
// Size: 0x8
// Has VTable
// Is Abstract
// Has Trivial Destructor
class CEntityComponent
{
private:
	[[maybe_unused]] uint8_t __pad0000[0x8]; // 0x0
public:
	// No schema binary for binding
};

// Registered binary: client.dll (project 'client')
// Alignment: 8
// Size: 0x58
// Has VTable
// 
// MNetworkVarNames "int32 m_iGlowType"
// MNetworkVarNames "int32 m_iGlowTeam"
// MNetworkVarNames "int32 m_nGlowRange"
// MNetworkVarNames "int32 m_nGlowRangeMin"
// MNetworkVarNames "Color m_glowColorOverride"
// MNetworkVarNames "bool m_bFlashing"
// MNetworkVarNames "float m_flGlowTime"
// MNetworkVarNames "float m_flGlowStartTime"
class CGlowProperty
{
private:
	[[maybe_unused]] uint8_t __pad0000[0x8]; // 0x0
public:
	Vector m_fGlowColor; // 0x8	
private:
	[[maybe_unused]] uint8_t __pad0014[0x1c]; // 0x14
public:
	// MNetworkEnable
	// MNetworkChangeCallback "OnGlowTypeChanged"
	int32_t m_iGlowType; // 0x30	
	// MNetworkEnable
	int32_t m_iGlowTeam; // 0x34	
	// MNetworkEnable
	int32_t m_nGlowRange; // 0x38	
	// MNetworkEnable
	int32_t m_nGlowRangeMin; // 0x3c	
	// MNetworkEnable
	// MNetworkChangeCallback "OnGlowColorChanged"
	Color m_glowColorOverride; // 0x40	
	// MNetworkEnable
	bool m_bFlashing; // 0x44	
private:
	[[maybe_unused]] uint8_t __pad0045[0x3]; // 0x45
public:
	// MNetworkEnable
	float m_flGlowTime; // 0x48	
	// MNetworkEnable
	float m_flGlowStartTime; // 0x4c	
	bool m_bGlowing; // 0x50	
};

// Registered binary: client.dll (project 'client')
// Alignment: 8
// Size: 0x30
// Has VTable
// Has Trivial Destructor
// 
// MNetworkVarNames "uint64 m_nInteractsAs"
// MNetworkVarNames "uint64 m_nInteractsWith"
// MNetworkVarNames "uint64 m_nInteractsExclude"
// MNetworkVarNames "uint32 m_nEntityId"
// MNetworkVarNames "uint32 m_nOwnerId"
// MNetworkVarNames "uint16 m_nHierarchyId"
// MNetworkVarNames "uint8 m_nCollisionGroup"
// MNetworkVarNames "uint8 m_nCollisionFunctionMask"
struct VPhysicsCollisionAttribute_t
{
private:
	[[maybe_unused]] uint8_t __pad0000[0x8]; // 0x0
public:
	// MNetworkEnable
	uint64_t m_nInteractsAs; // 0x8	
	// MNetworkEnable
	uint64_t m_nInteractsWith; // 0x10	
	// MNetworkEnable
	uint64_t m_nInteractsExclude; // 0x18	
	// MNetworkEnable
	uint32_t m_nEntityId; // 0x20	
	// MNetworkEnable
	uint32_t m_nOwnerId; // 0x24	
	// MNetworkEnable
	uint16_t m_nHierarchyId; // 0x28	
	// MNetworkEnable
	uint8_t m_nCollisionGroup; // 0x2a	
	// MNetworkEnable
	uint8_t m_nCollisionFunctionMask; // 0x2b	
};

// Registered binary: client.dll (project 'client')
// Alignment: 8
// Size: 0x14e0
// Has VTable
// 
// MGetKV3ClassDefaults
// MVDataOverlayType
class CitadelAbilityVData : public CEntitySubclassVDataBase
{
public:
	// MPropertyStartGroup "Meta"
	EAbilityType_t m_eAbilityType; // 0x28	
	// MPropertyStartGroup "Meta"
	EItemSlotTypes_t m_eItemSlotType; // 0x29	
	bool m_bDisabled; // 0x2a	
	bool m_bInDevelopment; // 0x2b	
	bool m_bStartTrained; // 0x2c	
private:
	[[maybe_unused]] uint8_t __pad002d[0x3]; // 0x2d
public:
	int32_t m_iMaxLevel; // 0x30	
	int32_t m_nAbilityPointsCost; // 0x34	
	int32_t m_nAbillityUnlocksCost; // 0x38	
private:
	[[maybe_unused]] uint8_t __pad003c[0x4]; // 0x3c
public:
	uint64_t m_iUpdateTime; // 0x40	
private:
	[[maybe_unused]] uint8_t __pad0048[0x8]; // 0x48
public:
	// MPropertyStartGroup "Behavior"
	EAbilityBehavior_t m_nAbilityBehaviors; // 0x50	
	EAbilityTargetingLocation_t m_eAbilityTargetingLocation; // 0x58	
	EAbilityTargetingShape_t m_eAbilityTargetingShape; // 0x5c	
	// MPropertySuppressExpr "m_eAbilityTargetingShape != CITADEL_ABILITY_TARGETING_SHAPE_CONE"
	float m_flTargetingConeAngle; // 0x60	
	// MPropertySuppressExpr "m_eAbilityTargetingShape != CITADEL_ABILITY_TARGETING_SHAPE_CONE"
	float m_flTargetingConeHalfWidth; // 0x64	
	// MPropertyDescription "When true, we will do an extra trace with the same cone shape, but with the cone laying flat in XY"
	// MPropertySuppressExpr "m_eAbilityTargetingShape != CITADEL_ABILITY_TARGETING_SHAPE_CONE"
	bool m_bIncludeExtra2DCone; // 0x68	
private:
	[[maybe_unused]] uint8_t __pad0069[0x3]; // 0x69
public:
	EAbilityActivation_t m_eAbilityActivation; // 0x6c	
	// MPropertyDescription "If set, this button must be down in addition to our trigger button (be default the slot button) in order to activate this ability."
	InputBitMask_t m_TriggerButtonPreReqButton; // 0x70	
	// MPropertyDescription "If set, this is the button requierd to be pressed to activate this ability."
	InputBitMask_t m_TriggerButtonOverride; // 0x78	
	EAbilitySpectatePriority m_eAbilitySpectatePriority; // 0x80	
private:
	[[maybe_unused]] uint8_t __pad0081[0x3]; // 0x81
public:
	CBitVecEnum< EModifierState > m_bitsInterruptingStates; // 0x84	
	IncompatibleFilter_t m_IncompatibleFilter; // 0x98	
	CITADEL_UNIT_TARGET_TYPE m_nAbilityTargetTypes; // 0xa8	
	CITADEL_UNIT_TARGET_FLAGS m_nAbilityTargetFlags; // 0xac	
	// MPropertyDescription "During post-cast, what modifier states are set."
	CBitVecEnum< EModifierState > m_bitsPostCastEnabledStateMask; // 0xb0	
	// MPropertyDescription "This ability provides these types of ability target effects."
	ECitadelTargetAbilityEffects m_TargetAbilityEffectsToApply; // 0xc4	
	bool m_bShowTargetingPreviewWhileChanneling; // 0xc8	
	bool m_bShowTargetingPreviewWhileCasting; // 0xc9	
private:
	[[maybe_unused]] uint8_t __pad00ca[0x6]; // 0xca
public:
	// MPropertyStartGroup
	// MPropertyFriendlyName "Weapon Info"
	CCitadelWeaponInfo m_WeaponInfo; // 0xd0	
	// MPropertyFriendlyName "Projectile Info"
	ProjectileInfo_t m_projectileInfo; // 0x728	
	// MPropertyFriendlyName "Deployment Info"
	DeploymentInfo_t m_deploymentInfo; // 0xa98	
	// MPropertyStartGroup
	CUtlOrderedMap< CUtlString, CitadelAbilityProperty_t > m_mapAbilityProperties; // 0xc78	
	CUtlVector< CSubclassName< 4 > > m_vecDependentAbilities; // 0xca0	
	CUtlVector< AbilityUpgrade_t > m_vecAbilityUpgrades; // 0xcb8	
private:
	[[maybe_unused]] uint8_t __pad0cd0[0x20]; // 0xcd0
public:
	// MPropertyStartGroup "AnimGraph"
	// MPropertyLeafSuggestionProviderFn
	CGlobalSymbol m_strCastAnimGraphParam; // 0xcf0	
	// MPropertyDescription "If set, this will be the value passed to the animgraph when this ability is selected instead of the ability name."
	CUtlString m_strSelectionNameOverride; // 0xcf8	
	CUtlString m_strCastAnimSequenceName; // 0xd00	
	// MPropertyStartGroup "UI"
	// MPropertySuppressExpr "m_bIsSignatureAbility == false"
	AbilityTooltipDetails_t m_AbilityTooltipDetails; // 0xd08	
	CUtlString m_strCSSClass; // 0xd38	
	CPanoramaImageName m_strAbilityImage; // 0xd40	
	CUtlString m_strMoviePreviewPath; // 0xd50	
	CitadelAbilityHUDPanel_t m_HUDPanel; // 0xd58	
	bool m_bShowInPassiveItemsArea; // 0xd90	
	bool m_bForceShowHUDPanel; // 0xd91	
private:
	[[maybe_unused]] uint8_t __pad0d92[0x6]; // 0xd92
public:
	// MPropertyFriendlyName "Additional Abilities"
	AdditionalAbilities_t m_additionalAbilities; // 0xd98	
	CUtlString m_strCancelAbilityKey; // 0xdb8	
	CUtlString m_strSecondaryStatName; // 0xdc0	
	// MPropertyStartGroup "Camera"
	// MPropertyDescription "Camera sequence that plays when casting starts and stops when casting completes, unless the bool below is un-checked"
	CitadelCameraOperationsSequence_t m_cameraSequenceCastStart; // 0xdc8	
	// MPropertyDescription "By default, we stop the sequence from 'Sequence Cast Start' once the cast completes successfully.  Un-check this to allow it to continue past the cast."
	bool m_bEndCastStartSequenceOnCastComplete; // 0xe48	
private:
	[[maybe_unused]] uint8_t __pad0e49[0x7]; // 0xe49
public:
	// MPropertyDescription "Camera sequence that plays when casting completes."
	CitadelCameraOperationsSequence_t m_cameraSequenceCastComplete; // 0xe50	
	// MPropertyDescription "Camera sequence that plays when channeling starts and is stopped when channeling ends, unless the bool below is un-checked."
	CitadelCameraOperationsSequence_t m_cameraSequenceChannelStart; // 0xed0	
	// MPropertyDescription "By default, we stop the sequence from 'Sequence Channel Start' once the channel completes successfully.  Un-check this to allow it to continue past the channel duration."
	bool m_bEndChannelStartSequenceOnChannelComplete; // 0xf50	
private:
	[[maybe_unused]] uint8_t __pad0f51[0x3]; // 0xf51
public:
	float m_flCameraPreviewOffset; // 0xf54	
	float m_flCameraPreviewDistance; // 0xf58	
	float m_flCameraPreviewSpeed; // 0xf5c	
	// MPropertyStartGroup "Visuals"
	// MPropertyDescription "Preview particle attaching to the caster before cast"
	CResourceNameTyped< CWeakHandle< InfoForResourceTypeIParticleSystemDefinition > > m_previewParticle; // 0xf60	
	// MPropertyDescription "Preview path particle shows ability's custom path"
	CResourceNameTyped< CWeakHandle< InfoForResourceTypeIParticleSystemDefinition > > m_PreviewPathParticle; // 0x1040	
	// MPropertyDescription "Particle attaching to the caster on cast event"
	CUtlOrderedMap< AbilityCastEvent_t, CResourceNameTyped< CWeakHandle< InfoForResourceTypeIParticleSystemDefinition > > > m_mapCastEventParticles; // 0x1120	
	// MPropertyDescription "Trace particle when hit an enemy with targeted ability"
	CResourceNameTyped< CWeakHandle< InfoForResourceTypeIParticleSystemDefinition > > m_skillshotHitParticle; // 0x1148	
	// MPropertyDescription "Trace particle when missed an enemy with targeted ability"
	CResourceNameTyped< CWeakHandle< InfoForResourceTypeIParticleSystemDefinition > > m_skillshotMissParticle; // 0x1228	
	// MPropertyDescription "Preview particle on attaching to targets of this ability"
	CResourceNameTyped< CWeakHandle< InfoForResourceTypeIParticleSystemDefinition > > m_TargetingPreviewParticle; // 0x1308	
	// MPropertyStartGroup "Sounds"
	CSoundEventName m_strSelectedSound; // 0x13e8	
	CSoundEventName m_strUnselectedSound; // 0x13f8	
	CSoundEventName m_strSelectedLoopSound; // 0x1408	
	CSoundEventName m_strCastSound; // 0x1418	
	CSoundEventName m_strChannelSound; // 0x1428	
	CSoundEventName m_strChannelLoopSound; // 0x1438	
	CSoundEventName m_strCastDelaySound; // 0x1448	
	CSoundEventName m_strCastDelayLoopSound; // 0x1458	
	// MPropertyDescription "plays for local player attacker dealing damage with this ability"
	CSoundEventName m_strHitConfirmationSound; // 0x1468	
	// MPropertyDescription "plays for local player victim taking damage from this ability"
	CSoundEventName m_strDamageTakenSound; // 0x1478	
	CSoundEventName m_strAbilityOffCooldownSound; // 0x1488	
	CSoundEventName m_strAbilityChargeReadySound; // 0x1498	
	// MPropertyStartGroup "Modifiers"
	CEmbeddedSubclass< CBaseModifier > m_AutoChannelModifier; // 0x14a8	
	CEmbeddedSubclass< CBaseModifier > m_AutoCastDelayModifier; // 0x14b8	
	CUtlVector< CEmbeddedSubclass< CBaseModifier > > m_AutoIntrinsicModifiers; // 0x14c8	
};

// Registered binary: client.dll (project 'client')
// Alignment: 8
// Size: 0x18b0
// Has VTable
// 
// MGetKV3ClassDefaults
class CCitadel_Ability_Tokamak_CrimsonCannonVData : public CitadelAbilityVData
{
public:
	// MPropertyStartGroup "Visuals"
	CResourceNameTyped< CWeakHandle< InfoForResourceTypeIParticleSystemDefinition > > m_LaserShot; // 0x14e0	
	CResourceNameTyped< CWeakHandle< InfoForResourceTypeIParticleSystemDefinition > > m_ChargeParticle; // 0x15c0	
	CResourceNameTyped< CWeakHandle< InfoForResourceTypeIParticleSystemDefinition > > m_CasterOnlyTargetParticle; // 0x16a0	
	CResourceNameTyped< CWeakHandle< InfoForResourceTypeIParticleSystemDefinition > > m_EnemyTargetedParticle; // 0x1780	
	// MPropertyStartGroup "Sounds"
	CSoundEventName m_strEnemyBeenTargetedSound; // 0x1860	
	CSoundEventName m_strCasterTargetSelectedSound; // 0x1870	
	CSoundEventName m_strFireSound; // 0x1880	
	CSoundEventName m_strImpactSound; // 0x1890	
	CSoundEventName m_strBlockedSound; // 0x18a0	
};

// Registered binary: client.dll (project 'client')
// Alignment: 8
// Size: 0x138
// Has VTable
class CCitadel_Modifier_HollowPoint_Proc : public CCitadelModifier
{
public:
	int32_t m_nStacksPerBullet; // 0xc0	
};

// Registered binary: client.dll (project 'client')
// Alignment: 8
// Size: 0x620
// Has VTable
// 
// MGetKV3ClassDefaults
class CCitadel_Modifier_BaseEventProcVData : public CCitadelModifierVData
{
public:
	bool m_bProcChanceAffectedByEffectiveness; // 0x5f0	
	bool m_bShouldApplyAbilityCooldown; // 0x5f1	
	// MPropertySuppressExpr "m_bCanProcMultipleTimesFromSameShot != true"
	bool m_bCanProcMultipleTimesOnOneTarget; // 0x5f2	
	bool m_bCanProcByOtherObjects; // 0x5f3	
	CITADEL_UNIT_TARGET_TYPE m_nAbilityTargetTypes; // 0x5f4	
	CITADEL_UNIT_TARGET_FLAGS m_nAbilityTargetFlags; // 0x5f8	
private:
	[[maybe_unused]] uint8_t __pad05fc[0x4]; // 0x5fc
public:
	CUtlVector< ECitadelDamageType > m_vecProcDamageTypes; // 0x600	
	TakeDamageFlags_t m_nRequiredDamageFlags; // 0x618	
};

// Registered binary: client.dll (project 'client')
// Alignment: 8
// Size: 0x68
// Has VTable
// Has Trivial Destructor
// 
// MNetworkVarNames "Vector dirPrimary"
// MNetworkVarNames "Color colorPrimary"
// MNetworkVarNames "Color colorSecondary"
// MNetworkVarNames "Color colorPrimaryLerpTo"
// MNetworkVarNames "Color colorSecondaryLerpTo"
// MNetworkVarNames "float32 start"
// MNetworkVarNames "float32 end"
// MNetworkVarNames "float32 farz"
// MNetworkVarNames "float32 maxdensity"
// MNetworkVarNames "float32 exponent"
// MNetworkVarNames "float32 HDRColorScale"
// MNetworkVarNames "float32 skyboxFogFactor"
// MNetworkVarNames "float32 skyboxFogFactorLerpTo"
// MNetworkVarNames "float32 startLerpTo"
// MNetworkVarNames "float32 endLerpTo"
// MNetworkVarNames "float32 maxdensityLerpTo"
// MNetworkVarNames "GameTime_t lerptime"
// MNetworkVarNames "float32 duration"
// MNetworkVarNames "float32 blendtobackground"
// MNetworkVarNames "float32 scattering"
// MNetworkVarNames "float32 locallightscale"
// MNetworkVarNames "bool enable"
// MNetworkVarNames "bool blend"
// MNetworkVarNames "bool m_bNoReflectionFog"
struct fogparams_t
{
private:
	[[maybe_unused]] uint8_t __pad0000[0x8]; // 0x0
public:
	// MNetworkEnable
	// MNetworkEncoder "coord"
	Vector dirPrimary; // 0x8	
	// MNetworkEnable
	Color colorPrimary; // 0x14	
	// MNetworkEnable
	Color colorSecondary; // 0x18	
	// MNetworkEnable
	// MNetworkUserGroup "FogController"
	Color colorPrimaryLerpTo; // 0x1c	
	// MNetworkEnable
	// MNetworkUserGroup "FogController"
	Color colorSecondaryLerpTo; // 0x20	
	// MNetworkEnable
	float start; // 0x24	
	// MNetworkEnable
	float end; // 0x28	
	// MNetworkEnable
	// MNetworkUserGroup "FogController"
	float farz; // 0x2c	
	// MNetworkEnable
	float maxdensity; // 0x30	
	// MNetworkEnable
	float exponent; // 0x34	
	// MNetworkEnable
	float HDRColorScale; // 0x38	
	// MNetworkEnable
	// MNetworkUserGroup "FogController"
	float skyboxFogFactor; // 0x3c	
	// MNetworkEnable
	// MNetworkUserGroup "FogController"
	float skyboxFogFactorLerpTo; // 0x40	
	// MNetworkEnable
	// MNetworkUserGroup "FogController"
	float startLerpTo; // 0x44	
	// MNetworkEnable
	// MNetworkUserGroup "FogController"
	float endLerpTo; // 0x48	
	// MNetworkEnable
	// MNetworkUserGroup "FogController"
	float maxdensityLerpTo; // 0x4c	
	// MNetworkEnable
	// MNetworkUserGroup "FogController"
	GameTime_t lerptime; // 0x50	
	// MNetworkEnable
	// MNetworkUserGroup "FogController"
	float duration; // 0x54	
	// MNetworkEnable
	// MNetworkUserGroup "FogController"
	float blendtobackground; // 0x58	
	// MNetworkEnable
	// MNetworkUserGroup "FogController"
	float scattering; // 0x5c	
	// MNetworkEnable
	// MNetworkUserGroup "FogController"
	float locallightscale; // 0x60	
	// MNetworkEnable
	bool enable; // 0x64	
	// MNetworkEnable
	bool blend; // 0x65	
	// MNetworkEnable
	bool m_bNoReflectionFog; // 0x66	
	bool m_bPadding; // 0x67	
};

// Registered binary: client.dll (project 'client')
// Alignment: 8
// Size: 0x48
// Has VTable
// 
// MNetworkVarNames "CTransform m_Transforms"
// MNetworkVarNames "EHANDLE m_hOwner"
struct PhysicsRagdollPose_t
{
private:
	[[maybe_unused]] uint8_t __pad0000[0x8]; // 0x0
public:
	// MNetworkEnable
	// MNetworkChangeCallback "OnTransformChanged"
	C_NetworkUtlVectorBase< CTransform > m_Transforms; // 0x8	
	// MNetworkEnable
	CHandle< C_BaseEntity > m_hOwner; // 0x20	
};

// Registered binary: client.dll (project 'client')
// Alignment: 8
// Size: 0x538
// Has VTable
// 
// MNetworkExcludeByName "m_bClientSideRagdoll"
// MNetworkExcludeByName "m_iMaxHealth"
// MNetworkExcludeByUserGroup "Player"
// MNetworkExcludeByUserGroup "Water"
// MNetworkExcludeByUserGroup "LocalPlayerExclusive"
// MNetworkExcludeByName "m_spawnflags"
// MNetworkExcludeByName "m_bTakesDamage"
// MNetworkExcludeByName "m_nTakeDamageFlags"
// MNetworkExcludeByName "m_vecAbsVelocity"
// MNetworkExcludeByName "m_flSpeed"
// MNetworkVarNames "CBodyComponent::Storage_t m_CBodyComponent"
// MNetworkVarNames "CModifierProperty * m_pModifierProp"
// MNetworkVarNames "int32 m_iMaxHealth"
// MNetworkVarNames "int32 m_iHealth"
// MNetworkVarNames "uint8 m_lifeState"
// MNetworkVarNames "bool m_bTakesDamage"
// MNetworkVarNames "TakeDamageFlags_t m_nTakeDamageFlags"
// MNetworkVarNames "EntityPlatformTypes_t m_nPlatformType"
// MNetworkVarNames "uint8 m_ubInterpolationFrame"
// MNetworkVarNames "EntitySubclassID_t m_nSubclassID"
// MNetworkVarNames "float32 m_flAnimTime"
// MNetworkVarNames "float32 m_flSimulationTime"
// MNetworkVarNames "GameTime_t m_flCreateTime"
// MNetworkVarNames "float m_flSpeed"
// MNetworkVarNames "bool m_bClientSideRagdoll"
// MNetworkVarNames "uint8 m_iTeamNum"
// MNetworkVarNames "uint32 m_spawnflags"
// MNetworkVarNames "GameTick_t m_nNextThinkTick"
// MNetworkVarNames "uint32 m_fFlags"
// MNetworkVarNames "CHandle< CBaseEntity> m_hEffectEntity"
// MNetworkVarNames "CHandle< CBaseEntity> m_hOwnerEntity"
// MNetworkVarNames "MoveCollide_t m_MoveCollide"
// MNetworkVarNames "MoveType_t m_MoveType"
// MNetworkVarNames "float32 m_flWaterLevel"
// MNetworkVarNames "uint32 m_fEffects"
// MNetworkVarNames "CHandle< CBaseEntity> m_hGroundEntity"
// MNetworkVarNames "int m_nGroundBodyIndex"
// MNetworkVarNames "float32 m_flFriction"
// MNetworkVarNames "float32 m_flElasticity"
// MNetworkVarNames "float32 m_flGravityScale"
// MNetworkVarNames "float32 m_flTimeScale"
// MNetworkVarNames "bool m_bAnimatedEveryTick"
// MNetworkVarNames "GameTime_t m_flNavIgnoreUntilTime"
class C_BaseEntity : public CEntityInstance
{
public:
	// MNetworkEnable
	// MNetworkUserGroup "CBodyComponent"
	// MNetworkAlias "CBodyComponent"
	// MNetworkTypeAlias "CBodyComponent"
	// MNetworkPriority "48"
	CBodyComponent* m_CBodyComponent; // 0x38	
	CNetworkTransmitComponent m_NetworkTransmitComponent; // 0x40	
private:
	[[maybe_unused]] uint8_t __pad01e0[0x120]; // 0x1e0
public:
	GameTick_t m_nLastThinkTick; // 0x300	
private:
	[[maybe_unused]] uint8_t __pad0304[0x4]; // 0x304
public:
	CGameSceneNode* m_pGameSceneNode; // 0x308	
	CRenderComponent* m_pRenderComponent; // 0x310	
	CCollisionProperty* m_pCollision; // 0x318	
	// MNetworkEnable
	// MNetworkChangePointerCallback
	CModifierProperty* m_pModifierProp; // 0x320	
	// MNetworkEnable
	// MNetworkUserGroup "LocalPlayerExclusive"
	int32_t m_iMaxHealth; // 0x328	
	// MNetworkEnable
	// MNetworkSerializer "ClampHealth"
	// MNetworkUserGroup "Player"
	// MNetworkPriority "32"
	int32_t m_iHealth; // 0x32c	
	// MNetworkEnable
	// MNetworkUserGroup "Player"
	// MNetworkPriority "32"
	uint8_t m_lifeState; // 0x330	
	// MNetworkEnable
	bool m_bTakesDamage; // 0x331	
private:
	[[maybe_unused]] uint8_t __pad0332[0x6]; // 0x332
public:
	// MNetworkEnable
	TakeDamageFlags_t m_nTakeDamageFlags; // 0x338	
	// MNetworkEnable
	EntityPlatformTypes_t m_nPlatformType; // 0x340	
	// MNetworkEnable
	// MNetworkChangeCallback "OnInterpolationFrameChanged"
	uint8_t m_ubInterpolationFrame; // 0x341	
private:
	[[maybe_unused]] uint8_t __pad0342[0x2]; // 0x342
public:
	CHandle< C_BaseEntity > m_hSceneObjectController; // 0x344	
	int32_t m_nNoInterpolationTick; // 0x348	
	int32_t m_nVisibilityNoInterpolationTick; // 0x34c	
	float m_flProxyRandomValue; // 0x350	
	int32_t m_iEFlags; // 0x354	
	uint8_t m_nWaterType; // 0x358	
	bool m_bInterpolateEvenWithNoModel; // 0x359	
	bool m_bPredictionEligible; // 0x35a	
	bool m_bApplyLayerMatchIDToModel; // 0x35b	
	CUtlStringToken m_tokLayerMatchID; // 0x35c	
	// MNetworkEnable
	// MNetworkChangeCallback "OnSubclassIDChanged"
	CUtlStringToken m_nSubclassID; // 0x360	
private:
	[[maybe_unused]] uint8_t __pad0364[0xc]; // 0x364
public:
	int32_t m_nSimulationTick; // 0x370	
	int32_t m_iCurrentThinkContext; // 0x374	
	CUtlVector< thinkfunc_t > m_aThinkFunctions; // 0x378	
	bool m_bDisabledContextThinks; // 0x390	
private:
	[[maybe_unused]] uint8_t __pad0391[0x3]; // 0x391
public:
	// MNetworkEnable
	// MNetworkPriority "0"
	// MNetworkSerializer "animTimeSerializer"
	float m_flAnimTime; // 0x394	
	// MNetworkEnable
	// MNetworkPriority "1"
	// MNetworkSerializer "simulationTimeSerializer"
	// MNetworkChangeCallback "OnSimulationTimeChanged"
	float m_flSimulationTime; // 0x398	
	uint8_t m_nSceneObjectOverrideFlags; // 0x39c	
	bool m_bHasSuccessfullyInterpolated; // 0x39d	
	bool m_bHasAddedVarsToInterpolation; // 0x39e	
	bool m_bRenderEvenWhenNotSuccessfullyInterpolated; // 0x39f	
	int32_t m_nInterpolationLatchDirtyFlags[2]; // 0x3a0	
	uint16_t m_ListEntry[11]; // 0x3a8	
private:
	[[maybe_unused]] uint8_t __pad03be[0x6]; // 0x3be
public:
	// MNetworkEnable
	GameTime_t m_flCreateTime; // 0x3c4	
	// MNetworkEnable
	float m_flSpeed; // 0x3c8	
	uint16_t m_EntClientFlags; // 0x3cc	
	// MNetworkEnable
	bool m_bClientSideRagdoll; // 0x3ce	
	// MNetworkEnable
	// MNetworkChangeCallback "OnNetVarTeamNumChanged"
	uint8_t m_iTeamNum; // 0x3cf	
	// MNetworkEnable
	uint32_t m_spawnflags; // 0x3d0	
	// MNetworkEnable
	// MNetworkUserGroup "LocalPlayerExclusive"
	GameTick_t m_nNextThinkTick; // 0x3d4	
	// MNetworkEnable
	// MNetworkPriority "32"
	// MNetworkUserGroup "Player"
	// MNetworkChangeCallback "OnFlagsChanged"
	uint32_t m_fFlags; // 0x3d8	
	Vector m_vecAbsVelocity; // 0x3dc	
	// MNetworkEnable
	// MNetworkUserGroup "LocalPlayerExclusive"
	// MNetworkChangeCallback "OnLocalVelocityChanged"
	// MNetworkPriority "32"
	CNetworkVelocityVector m_vecVelocity; // 0x3e8	
private:
	[[maybe_unused]] uint8_t __pad0410[0x8]; // 0x410
public:
	// MNetworkEnable
	CHandle< C_BaseEntity > m_hEffectEntity; // 0x418	
	// MNetworkEnable
	// MNetworkPriority "32"
	CHandle< C_BaseEntity > m_hOwnerEntity; // 0x41c	
	// MNetworkEnable
	MoveCollide_t m_MoveCollide; // 0x420	
	// MNetworkEnable
	// MNetworkChangeCallback "OnMoveTypeChanged"
	MoveType_t m_MoveType; // 0x421	
	MoveType_t m_nActualMoveType; // 0x422	
private:
	[[maybe_unused]] uint8_t __pad0423[0x1]; // 0x423
public:
	// MNetworkEnable
	// MNetworkUserGroup "Water"
	// MNetworkChangeCallback "OnWaterLevelChangeNetworked"
	// MNetworkBitCount "8"
	// MNetworkMinValue "0.000000"
	// MNetworkMaxValue "1.000000"
	// MNetworkEncodeFlags "8"
	float m_flWaterLevel; // 0x424	
	// MNetworkEnable
	// MNetworkChangeCallback "OnEffectsChanged"
	uint32_t m_fEffects; // 0x428	
	// MNetworkEnable
	// MNetworkPriority "32"
	// MNetworkUserGroup "Player"
	CHandle< C_BaseEntity > m_hGroundEntity; // 0x42c	
	// MNetworkEnable
	// MNetworkPriority "32"
	// MNetworkUserGroup "Player"
	int32_t m_nGroundBodyIndex; // 0x430	
	// MNetworkEnable
	// MNetworkBitCount "8"
	// MNetworkMinValue "0.000000"
	// MNetworkMaxValue "4.000000"
	// MNetworkEncodeFlags "1"
	// MNetworkUserGroup "LocalPlayerExclusive"
	float m_flFriction; // 0x434	
	// MNetworkEnable
	// MNetworkEncoder "coord"
	float m_flElasticity; // 0x438	
	// MNetworkEnable
	// MNetworkUserGroup "LocalPlayerExclusive"
	float m_flGravityScale; // 0x43c	
	// MNetworkEnable
	// MNetworkUserGroup "LocalPlayerExclusive"
	float m_flTimeScale; // 0x440	
	// MNetworkEnable
	// MNetworkChangeCallback "OnInterpolationAmountChanged"
	bool m_bAnimatedEveryTick; // 0x444	
private:
	[[maybe_unused]] uint8_t __pad0445[0x3]; // 0x445
public:
	// MNetworkEnable
	// MNetworkChangeCallback "OnNavIgnoreChanged"
	GameTime_t m_flNavIgnoreUntilTime; // 0x448	
	uint16_t m_hThink; // 0x44c	
private:
	[[maybe_unused]] uint8_t __pad044e[0xa]; // 0x44e
public:
	uint8_t m_fBBoxVisFlags; // 0x458	
	bool m_bPredictable; // 0x459	
	bool m_bRenderWithViewModels; // 0x45a	
private:
	[[maybe_unused]] uint8_t __pad045b[0x1]; // 0x45b
public:
	CSplitScreenSlot m_nSplitUserPlayerPredictionSlot; // 0x45c	
	int32_t m_nFirstPredictableCommand; // 0x460	
	int32_t m_nLastPredictableCommand; // 0x464	
	CHandle< C_BaseEntity > m_hOldMoveParent; // 0x468	
private:
	[[maybe_unused]] uint8_t __pad046c[0x4]; // 0x46c
public:
	CParticleProperty m_Particles; // 0x470	
	CUtlVector< float32 > m_vecPredictedScriptFloats; // 0x498	
	CUtlVector< int32 > m_vecPredictedScriptFloatIDs; // 0x4b0	
private:
	[[maybe_unused]] uint8_t __pad04c8[0x18]; // 0x4c8
public:
	int32_t m_nNextScriptVarRecordID; // 0x4e0	
private:
	[[maybe_unused]] uint8_t __pad04e4[0xc]; // 0x4e4
public:
	QAngle m_vecAngVelocity; // 0x4f0	
	int32_t m_DataChangeEventRef; // 0x4fc	
	CUtlVector< CEntityHandle > m_dependencies; // 0x500	
	int32_t m_nCreationTick; // 0x518	
private:
	[[maybe_unused]] uint8_t __pad051c[0x9]; // 0x51c
public:
	bool m_bAnimTimeChanged; // 0x525	
	bool m_bSimulationTimeChanged; // 0x526	
private:
	[[maybe_unused]] uint8_t __pad0527[0x9]; // 0x527
public:
	CUtlString m_sUniqueHammerID; // 0x530	
	
	// Static fields:
	static bool &Get_sm_bDatadescValidating(){return *reinterpret_cast<bool*>(interfaces::g_schema->FindTypeScopeForModule("client.dll")->FindDeclaredClass("C_BaseEntity")->m_static_fields[0]->m_instance);};
	static bool &Get_sm_bAccurateTriggerBboxChecks(){return *reinterpret_cast<bool*>(interfaces::g_schema->FindTypeScopeForModule("client.dll")->FindDeclaredClass("C_BaseEntity")->m_static_fields[1]->m_instance);};
	static bool &Get_sm_bDisableTouchFuncs(){return *reinterpret_cast<bool*>(interfaces::g_schema->FindTypeScopeForModule("client.dll")->FindDeclaredClass("C_BaseEntity")->m_static_fields[2]->m_instance);};
	static bool &Get_m_bAllowPrecache(){return *reinterpret_cast<bool*>(interfaces::g_schema->FindTypeScopeForModule("client.dll")->FindDeclaredClass("C_BaseEntity")->m_static_fields[3]->m_instance);};
	static LatchDirtyPermission_t &Get_s_nLatchPermissions(){return *reinterpret_cast<LatchDirtyPermission_t*>(interfaces::g_schema->FindTypeScopeForModule("client.dll")->FindDeclaredClass("C_BaseEntity")->m_static_fields[4]->m_instance);};
	static int32_t &Get_m_nPredictionRandomSeed(){return *reinterpret_cast<int32_t*>(interfaces::g_schema->FindTypeScopeForModule("client.dll")->FindDeclaredClass("C_BaseEntity")->m_static_fields[5]->m_instance);};
	static CBasePlayerController* &Get_m_pPredictionPlayerController(){return *reinterpret_cast<CBasePlayerController**>(interfaces::g_schema->FindTypeScopeForModule("client.dll")->FindDeclaredClass("C_BaseEntity")->m_static_fields[6]->m_instance);};
	static bool &Get_s_bAbsQueriesValid(){return *reinterpret_cast<bool*>(interfaces::g_schema->FindTypeScopeForModule("client.dll")->FindDeclaredClass("C_BaseEntity")->m_static_fields[7]->m_instance);};
	static bool &Get_s_bAbsRecomputationEnabled(){return *reinterpret_cast<bool*>(interfaces::g_schema->FindTypeScopeForModule("client.dll")->FindDeclaredClass("C_BaseEntity")->m_static_fields[8]->m_instance);};
	static bool &Get_s_bComputingInterpolatedValues(){return *reinterpret_cast<bool*>(interfaces::g_schema->FindTypeScopeForModule("client.dll")->FindDeclaredClass("C_BaseEntity")->m_static_fields[9]->m_instance);};
	static bool &Get_s_bPreventingSetAnimRunAnimEvents(){return *reinterpret_cast<bool*>(interfaces::g_schema->FindTypeScopeForModule("client.dll")->FindDeclaredClass("C_BaseEntity")->m_static_fields[10]->m_instance);};
	static CUtlVector< C_BaseEntity* > &Get_gm_UsableObjects(){return *reinterpret_cast<CUtlVector< C_BaseEntity* >*>(interfaces::g_schema->FindTypeScopeForModule("client.dll")->FindDeclaredClass("C_BaseEntity")->m_static_fields[11]->m_instance);};
	
	// Datamap fields:
	// CUtlSymbolLarge m_iszPrivateVScripts; // 0x8
	// void m_CScriptComponent; // 0x28
	// CUtlSymbolLarge subclass_name; // 0x7fffffff
	// void m_pSubclassVData; // 0x368
	// QAngle angles; // 0x7fffffff
	// Vector origin; // 0x7fffffff
	// CStrongHandle< InfoForResourceTypeCModel > model; // 0x7fffffff
	// CUtlString ownername; // 0x7fffffff
};

// Registered binary: client.dll (project 'client')
// Alignment: 8
// Size: 0x28
// Has VTable
// 
// MNetworkVarNames "uint32 m_bvDisabledHitGroups"
class CHitboxComponent : public CEntityComponent
{
private:
	[[maybe_unused]] uint8_t __pad0008[0x1c]; // 0x8
public:
	// MNetworkEnable
	uint32_t m_bvDisabledHitGroups[1]; // 0x24	
	
	// Static fields:
	static EntComponentInfo_t &Get_s_EntComponentInfo(){return *reinterpret_cast<EntComponentInfo_t*>(interfaces::g_schema->FindTypeScopeForModule("client.dll")->FindDeclaredClass("CHitboxComponent")->m_static_fields[0]->m_instance);};
	static int32_t &Get_entity_component_error_class_decl_says_referenced_but_impl_is_contained(){return *reinterpret_cast<int32_t*>(interfaces::g_schema->FindTypeScopeForModule("client.dll")->FindDeclaredClass("CHitboxComponent")->m_static_fields[1]->m_instance);};
};

// Registered binary: client.dll (project 'client')
// Alignment: 8
// Size: 0x7c0
// Has VTable
// 
// MGetKV3ClassDefaults
class CModifier_CloakingDevice_Active_Ambush_VData : public CCitadelModifierVData
{
public:
	// MPropertyStartGroup "Visuals"
	CResourceNameTyped< CWeakHandle< InfoForResourceTypeIParticleSystemDefinition > > m_InvisRevealedParticle; // 0x5f0	
	CResourceNameTyped< CWeakHandle< InfoForResourceTypeIParticleSystemDefinition > > m_AmbushParticle; // 0x6d0	
	// MPropertyStartGroup "Sounds"
	CSoundEventName m_strActivateAmbushSound; // 0x7b0	
};

// Registered binary: client.dll (project 'client')
// Alignment: 8
// Size: 0x130
// Has VTable
class CCitadel_Modifier_Tech_Defender_Shredders_Debuff : public CCitadelModifier
{
public:
	// No schema binary for binding
};

// Registered binary: client.dll (project 'client')
// Alignment: 8
// Size: 0x538
// Has VTable
class C_SoundEventEntity : public C_BaseEntity
{
public:
	// No schema binary for binding
};

// Registered binary: client.dll (project 'client')
// Alignment: 8
// Size: 0x15f0
// Has VTable
// 
// MGetKV3ClassDefaults
class CAbility_Synth_Blitz_VData : public CitadelAbilityVData
{
public:
	// MPropertyStartGroup "Modifiers"
	CEmbeddedSubclass< CCitadelModifier > m_BlitzModifier; // 0x14e0	
	CEmbeddedSubclass< CCitadelModifier > m_TechAmpModifier; // 0x14f0	
	// MPropertyStartGroup "Visuals"
	CResourceNameTyped< CWeakHandle< InfoForResourceTypeIParticleSystemDefinition > > m_SlowParticle; // 0x1500	
	// MPropertyStartGroup "Sounds"
	CSoundEventName m_strProcSound; // 0x15e0	
};

// Registered binary: client.dll (project 'client')
// Alignment: 8
// Size: 0xc28
// Has VTable
// Is Abstract
// 
// MNetworkIncludeByName "m_flTimeScale"
// MNetworkExcludeByName "m_angRotation"
// MNetworkExcludeByName "m_blinktoggle"
// MNetworkExcludeByName "m_cellX"
// MNetworkExcludeByName "m_cellY"
// MNetworkExcludeByName "m_cellZ"
// MNetworkExcludeByName "m_flAnimTime"
// MNetworkExcludeByUserGroup "m_flCycle"
// MNetworkExcludeByName "m_flEncodedController"
// MNetworkExcludeByName "m_flPoseParameter"
// MNetworkExcludeByName "m_flSimulationTime"
// MNetworkExcludeByName "m_flexWeight"
// MNetworkExcludeByName "m_nForceBone"
// MNetworkExcludeByName "m_nHitboxSet"
// MNetworkExcludeByName "m_baseLayer.m_hSequence"
// MNetworkExcludeByName "m_vecForce"
// MNetworkExcludeByName "m_vecMaxs"
// MNetworkExcludeByName "m_vecMins"
// MNetworkExcludeByName "m_vecOrigin"
// MNetworkExcludeByName "m_vecSpecifiedSurroundingMaxs"
// MNetworkExcludeByName "m_vecSpecifiedSurroundingMins"
// MNetworkExcludeByName "m_vLookTargetPosition"
// MNetworkExcludeByName "m_MoveCollide"
// MNetworkExcludeByName "m_MoveType"
// MNetworkExcludeByName "m_Gender"
// MNetworkExcludeByName "m_flElasticity"
// MNetworkExcludeByName "m_nMinCPULevel"
// MNetworkExcludeByName "m_nMinGPULevel"
// MNetworkExcludeByName "m_nMaxCPULevel"
// MNetworkExcludeByName "m_nMaxGPULevel"
// MNetworkExcludeByName "m_flNavIgnoreUntilTime"
// MNetworkExcludeByName "m_ubInterpolationFrame"
// MNetworkExcludeByName "m_flScale"
// MNetworkExcludeByUserGroup "overlay_vars"
// MNetworkOverride "m_flTimeScale"
// MNetworkVarNames "bool m_bChanneling"
// MNetworkVarNames "bool m_bInCastDelay"
// MNetworkVarNames "EntitySubclassID_t m_vecImbuedByAbilitiyIDs"
// MNetworkVarNames "int m_nUpgradeBits"
// MNetworkVarNames "int m_iBucketID"
// MNetworkVarNames "bool m_bToggleState"
// MNetworkVarNames "GameTime_t m_flToggledTime"
// MNetworkVarNames "GameTime_t m_flCooldownStart"
// MNetworkVarNames "GameTime_t m_flCooldownEnd"
// MNetworkVarNames "GameTime_t m_flChannelStartTime"
// MNetworkVarNames "GameTime_t m_flCastDelayStartTime"
// MNetworkVarNames "EAbilitySlots_t m_eAbilitySlot"
// MNetworkVarNames "int m_iRemainingCharges"
// MNetworkVarNames "GameTime_t m_flChargeRechargeStart"
// MNetworkVarNames "GameTime_t m_flChargeRechargeEnd"
// MNetworkVarNames "GameTime_t m_flMovementControlActiveTime"
// MNetworkVarNames "GameTime_t m_flSelectedChangedTime"
// MNetworkVarNames "GameTime_t m_flAltCastHoldStartTime"
// MNetworkVarNames "AbilityID_t m_nImbuedAbilityID"
class C_CitadelBaseAbility : public C_BaseEntity
{
private:
	[[maybe_unused]] uint8_t __pad0538[0xc8]; // 0x538
public:
	CUtlVector< CModifierHandleTyped< CCitadelModifier > > m_vecIntrinsicModifiers; // 0x600	
	CModifierHandleTyped< CCitadelModifier > m_pCastDelayAutoModifier; // 0x618	
	CModifierHandleTyped< CCitadelModifier > m_pChannelAutoModifier; // 0x630	
	CGlobalSymbol m_strUsedCastGraphParam; // 0x648	
	int32_t m_nCastParamNeedsResetTick; // 0x650	
	bool m_bIsCoolingDownInternal; // 0x654	
private:
	[[maybe_unused]] uint8_t __pad0655[0x1b]; // 0x655
public:
	// MNetworkEnable
	// MNetworkChangeCallback "OnChannelingChanged"
	bool m_bChanneling; // 0x670	
	// MNetworkEnable
	// MNetworkChangeCallback "OnInCastDelayChanged"
	bool m_bInCastDelay; // 0x671	
private:
	[[maybe_unused]] uint8_t __pad0672[0x6]; // 0x672
public:
	// MNetworkEnable
	// MNetworkChangeCallback "OnAbilityImbuedChanged"
	C_NetworkUtlVectorBase< CUtlStringToken > m_vecImbuedByAbilitiyIDs; // 0x678	
	// MNetworkEnable
	// MNetworkChangeCallback "OnUpgradeBitsChanged"
	// MNetworkPriority "32"
	int32_t m_nUpgradeBits; // 0x690	
	// MNetworkEnable
	int32_t m_iBucketID; // 0x694	
	// MNetworkEnable
	bool m_bToggleState; // 0x698	
private:
	[[maybe_unused]] uint8_t __pad0699[0x3]; // 0x699
public:
	// MNetworkEnable
	GameTime_t m_flToggledTime; // 0x69c	
	// MNetworkEnable
	// MNetworkPriority "32"
	GameTime_t m_flCooldownStart; // 0x6a0	
	// MNetworkEnable
	// MNetworkPriority "32"
	GameTime_t m_flCooldownEnd; // 0x6a4	
	// MNetworkEnable
	GameTime_t m_flChannelStartTime; // 0x6a8	
	// MNetworkEnable
	GameTime_t m_flCastDelayStartTime; // 0x6ac	
	// MNetworkEnable
	// MNetworkChangeCallback "OnAbilitySlotChanged"
	EAbilitySlots_t m_eAbilitySlot; // 0x6b0	
private:
	[[maybe_unused]] uint8_t __pad06b2[0x2]; // 0x6b2
public:
	GameTime_t m_flPostCastDelayEndTime; // 0x6b4	
	// MNetworkEnable
	// MNetworkPriority "32"
